{
  "fr": {
    "PRESENTATION": "Bonjour, je suis Voikyrioh, développeur professionnel et je vous souhaite la bienvenue sur mon site ! \nPassionné de jeux vidéos, de jeux de rôle et d'univers fantastique. J'aime aussi développer sur mon temps libre et je vous partage ces passions et mon travail sur ce site.",
    "PROJECT.SLIME": "Slay the slime est un clicker que j'ai commencé à réaliser suite à une discussion avec un amis à propos des possibilités des animations en CSS. J'ai commencer à réaliser ce jeu afin d'approfondir mes connaissances en CSS et de m'entraîner avec vue.js. Le projet est encore en cours.",
    "PROJECT.IN_STOCK": "inStock a été créé suite à la pénurie des cartes graphiques Nvidia (série des 3000) en 2020, après une discussion avec un ami sur l'utilisation de scrapping afin de récupérer chercher les informations sur plusieurs sites d'une possible remise en stock. J'ai suite à ça réalisé un site en React (ce qui m'a permis de me former à l'époque sur cette techno) et une API avec Fastify.",
    "PROJECT.CUBE": "Suite à l'annonce par google de WebGPU en fin 2023, j'ai commencé à travailler sur ce projet. L'objectif était de me former à WebGPU mais aussi aux bases de la programmation graphique et j'avais comme ambition de réaliser un moteur de jeu simple sans utiliser aucune librairie. Pour le moment cet application permet de se balader en caméra libre autour d'un \"chunk\" de 16x16x16 cubes dont j'ai optimisé l'affichage.",
    "SEE_PROJECT": "Voir le projet"
  },
  "en": {
    "PRESENTATION": "Hello ! I'm Voikyrioh, a professional software engineer and I welcome you to my website ! \nI love video-games, role playing games and fantasy universes. I also like to develop programs on my free time and I'd like to share theses passions and my work on this website.",
    "PROJECT.SLIME": "Slay the slime is a clicker game that I started to make when a friend and I talked about CSS animations possibilities with the animation API. I made this project for fun but also to introduce myself to VueJS and learn some high level CSS. This project is still ongoing",
    "PROJECT.IN_STOCK": "When Nvidia had a shortage in 2020 (for the 3000 series) I got a conversation with a friend about scrapping and how it would be possible to check on vending websites with scrapping if there was any stock. I then started to work on a scrapping app written in typescript and optimised it. Then my friend asked if it was possible to make a website out of it and that's how InStock was created. This project helped me learn React (which at the time was useful since we started to use this framework at work).",
    "PROJECT.CUBE": "At the end of december 2023 Google announced WebGPU the successor of WebGL which had many limitations, It was a really good opportunity for me to learn graphics programming in a language I know and can easily develop on. Then I learned graphics programming and how to build a game engine (a very primitive one), my goal was to start from scratch and to not use any library. At the moment the game let you move in free motion in an empty world with only a \"chunk\" of 16x16x16 cubes. I took a lot of time to optimise as much as I could and I learned so much I think I'm happy with the result now and the project is on standby for now since I have other ideas for 3d programming.",
    "SEE_PROJECT": "Go to project"
  }
}
